euyju/VibeClean/HW/STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>    // printf, sprintf 사용
#include <stdarg.h>   // 가변 인자 사용
#include <math.h>
#include "ESP8266_HAL.h"
#include <string.h>   // strlen 사용
#include "stm32f4xx_hal.h" // HAL 함수 사용
#include "mpu6050.h"  // Edge-AI용 MPU6050 드라이버
#include "edge_ai_wrapper.h"  // Edge Impulse SDK Wrapper 헤더
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
// HC-SR04 핀 정의
#define TRIG_PIN    GPIO_PIN_0
#define TRIG_PORT    GPIOC
#define ECHO_PIN    GPIO_PIN_1
#define ECHO_PORT    GPIOA

#define TRIG_PIN1    GPIO_PIN_1
#define TRIG_PORT1    GPIOC
#define ECHO_PIN1    GPIO_PIN_8
#define ECHO_PORT1    GPIOB

#define TRIG_PIN2    GPIO_PIN_2
#define TRIG_PORT2    GPIOC
#define ECHO_PIN2    GPIO_PIN_10
#define ECHO_PORT2    GPIOB

uint8_t rx_data[100];

// 클럭 설정 (SystemClock_Config 기준 HCLK = 84MHz)
// 1초 = 84,000,000 사이클 -> 1us = 84 사이클
#define DWT_DELAY_UNIT (HAL_RCC_GetHCLKFreq() / 1000000)

// HC-SR04 관련 상수
#define SOUND_SPEED_CM_PER_US 0.0343 // 음속: 343m/s = 0.0343 cm/us
#define MAX_TIMEOUT_US 30000 // 30ms (HC-SR04 최대 측정 거리 고려)

// 모터 1 (A) - ENA: TIM1_CH1 (PA8)
// 방향 핀
#define M1_IN1_PORT GPIOB
#define M1_IN1_PIN  GPIO_PIN_0
#define M1_IN2_PORT GPIOB
#define M1_IN2_PIN  GPIO_PIN_1

// 모터 2 (B) - ENB: TIM1_CH2 (PA9)
// 방향 핀
#define M2_IN1_PORT GPIOB
#define M2_IN1_PIN  GPIO_PIN_2
#define M2_IN2_PORT GPIOB
#define M2_IN2_PIN  GPIO_PIN_12

// 모터 3 (A) - ENA: TIM4_CH1 (Pb6)
#define M3_IN1_PORT GPIOC
#define M3_IN1_PIN  GPIO_PIN_3
#define M3_IN2_PORT GPIOC
#define M3_IN2_PIN  GPIO_PIN_4

// RGB LED 핀 정의
#define LED_R_PORT GPIOB
#define LED_R_PIN  GPIO_PIN_13
#define LED_G_PORT GPIOB
#define LED_G_PIN  GPIO_PIN_14
#define LED_B_PORT GPIOB
#define LED_B_PIN  GPIO_PIN_15

// RGB LED 색상 정의 (Common Cathode: Active High)
#define RGB_OFF         0, 0, 0
#define RGB_RED         1, 0, 0
#define RGB_GREEN       0, 1, 0
#define RGB_BLUE        0, 0, 1
#define RGB_YELLOW      1, 1, 0
#define RGB_MAGENTA     1, 0, 1
#define RGB_CYAN        0, 1, 1
#define RGB_WHITE       1, 1, 1

// LED 상태 타이밍 (ms)
#define LED_BLINK_INTERVAL_BASE    1000  // 베이스 색상 표시 시간 (모드 색상)
#define LED_BLINK_INTERVAL_FLOOR   500   // 바닥 색상 표시 시간
#define LED_BLINK_INTERVAL_OBSTACLE 1000 // 장애물 회피 깜빡임

// LED 우선순위 상태 정의
typedef enum {
    LED_STATE_NORMAL = 0,        // 일반 동작 (모드/바닥 교차 깜빡임)
    LED_STATE_OBSTACLE = 1,      // 장애물 회피 (빨간색 깜빡임)
    LED_STATE_STANDBY = 2        // 대기 (빨간색 고정)
} LED_Priority_State_t;

// 모터 ID 및 방향 정의
#define MOTOR_A     1
#define MOTOR_B     2
#define MOTOR_C     3

#define FORWARD     1
#define BACKWARD    2
#define RIGHT    3 // 우회전
#define LEFT      4 // 좌회전 (필요시)
#define STOP        0

// PWM 최대값 (CubeMX TIM1 ARR 설정에 따라 변경될 수 있음. 여기서는 1000 가정)
#define PWM_MAX_VALUE 1000

// 벽 감지 임계 거리 (센티미터 단위)
#define WALL_DISTANCE_THRESHOLD 30.0f
// 직진 속도 및 회전 속도 (PWM 값)
#define BASE_SPEED          300
#define TURN_SPEED          300
// 회전 시간 상수 (90도 회전에 필요한 시간, 보정 필요)
#define TURN_90_TIME_MS     3200 // (모터와 바퀴에 따라 크게 달라짐)
// 유턴 시 전진/후진 거리 시간 (본체 폭만큼 이동하기 위한 시간, 보정 필요)
#define BODY_MOVE_TIME_MS   800 // 예시 값 (본체 폭에 따라 조절)

#define MPU6050_ADDR  (0x68 << 1)
#define PWR_MGMT_1    0x6B
#define ACCEL_XOUT_H  0x3B

// Edge-AI 관련 상수
#define EDGE_AI_SAMPLE_COUNT    200    // 2초 @ 100Hz
#define EDGE_AI_AXES            3      // 3축 가속도

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim8;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
TIM_HandleTypeDef htim2;
//2D 맵핑용 위치변수
float g_robot_x = 0.0f;     // 현재의 X 좌표
float g_robot_y = 0.0f;     // 현재의 Y 좌표
float g_robot_yaw = 0.0f;   // 현재의 방향 각도 (단위: 도 Degree)

// Edge-AI 데이터 버퍼
float edge_ai_buffer[EDGE_AI_SAMPLE_COUNT * EDGE_AI_AXES];
volatile uint16_t edge_ai_sample_index = 0;
volatile uint8_t edge_ai_buffer_ready = 0;

// IMU 센서 디버깅용 변수
volatile uint8_t imu_debug_counter = 0;  // 0.1초마다 출력하기 위한 카운터
volatile uint8_t imu_debug_ready = 0;    // 출력 준비 플래그
float imu_debug_ax, imu_debug_ay, imu_debug_az;  // 마지막 측정값 저장

// MQTT 관련 전역 변수
#define WIZFI360_MAX_RESPONSE_SIZE 512
char wizfi_rx_buffer[WIZFI360_MAX_RESPONSE_SIZE];

// MQTT Subscribe 수신 버퍼
#define MQTT_RX_BUF_SIZE 256
char mqtt_rx_buf[MQTT_RX_BUF_SIZE];
int mqtt_rx_len = 0;

// MQTT control 상태 변수
int g_powerOn = -1;          // 0 = OFF, 1 = ON
int g_fanSpeed = -1;         // 0~3
int g_modeManual = -1;       // 0 = AUTO, 1 = MANUAL
char g_direction[8] = "NULL";  // "FWD","BACK","LEFT","RIGHT","STOP"

// Edge-AI 판별 결과 저장 (실시간 업데이트)
char g_current_floor[16] = "Unknown";  // "Hard", "Carpet", "Dusty", "Unknown"

// LED 제어 상태 변수
LED_Priority_State_t g_led_priority_state = LED_STATE_NORMAL;
uint32_t g_led_last_update_tick = 0;
uint8_t g_led_toggle_state = 0;  // 0 or 1 (교차 깜빡임용)
/* USER CODE END PV */

