euyju/VibeClean/HW/STM32/Core/Src/main.c
    rotate_right_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(100);
}

/* 장애물 발견 시 회피 시퀀스:
   1) 정지
   2) 백업(짧게)
   3) 제자리 회전 90도 (우회전)
   4) 전진 (몸체 폭 만큼)
   5) 유턴(180)으로 라인 닫기(옵션)
*/
void R_avoidance_sequence(void)
{
    // LED 상태를 장애물 회피 모드로 설정
    set_led_priority_state(LED_STATE_OBSTACLE);

    // 1) 정지
    stop_all_motors();
    HAL_Delay(50);

    // 2) 백업
    move_backward_pwm(BASE_SPEED);
    HAL_Delay(300); // 300ms 뒤로 (조정 필요)
    stop_all_motors();
    HAL_Delay(50);

    // 3) 제자리 우회전 90도
    rotate_right_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 4) 전진으로 통과
    move_forward_pwm(BASE_SPEED);
    HAL_Delay(BODY_MOVE_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 5) 제자리 우회전 90도
    rotate_right_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 회피 완료 후 일반 모드로 복귀
    set_led_priority_state(LED_STATE_NORMAL);
}

void L_avoidance_sequence(void)
{
    // LED 상태를 장애물 회피 모드로 설정
    set_led_priority_state(LED_STATE_OBSTACLE);

    // 1) 정지
    stop_all_motors();
    HAL_Delay(50);

    // 2) 백업
    move_backward_pwm(BASE_SPEED);
    HAL_Delay(300); // 300ms 뒤로 (조정 필요)
    stop_all_motors();
    HAL_Delay(50);

    // 3) 제자리 좌회전 90도
    rotate_left_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 4) 전진으로 통과
    move_forward_pwm(BASE_SPEED);
    HAL_Delay(BODY_MOVE_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 5) 제자리 좌회전 90도
    rotate_left_inplace(TURN_SPEED);
    HAL_Delay(TURN_90_TIME_MS);
    stop_all_motors();
    HAL_Delay(50);

    // 회피 완료 후 일반 모드로 복귀
    set_led_priority_state(LED_STATE_NORMAL);
}

/**
  * @brief RGB LED 색상 설정 함수
  * @param r: Red 상태 (0=OFF, 1=ON)
  * @param g: Green 상태 (0=OFF, 1=ON)
  * @param b: Blue 상태 (0=OFF, 1=ON)
  * @retval None
  */
void set_rgb_led(uint8_t r, uint8_t g, uint8_t b)
{
    HAL_GPIO_WritePin(LED_R_PORT, LED_R_PIN, r ? GPIO_PIN_SET : GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_G_PORT, LED_G_PIN, g ? GPIO_PIN_SET : GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_B_PORT, LED_B_PIN, b ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

/**
  * @brief LED 우선순위 상태 설정 함수
  * @param state: LED_STATE_NORMAL, LED_STATE_OBSTACLE, LED_STATE_STANDBY
  * @retval None
  */
void set_led_priority_state(LED_Priority_State_t state)
{
    g_led_priority_state = state;
    g_led_toggle_state = 0;  // 상태 변경 시 토글 상태 초기화
    g_led_last_update_tick = HAL_GetTick();  // 타이머 리셋
}

/**
  * @brief LED 상태 업데이트 함수 (메인 루프에서 주기적으로 호출)
  * @retval None
  * @note 우선순위: STANDBY(최고) > OBSTACLE > NORMAL
  * @note 일반 모드: 베이스 색상(1000ms) ↔ 바닥 색상(500ms) 2:1 비율
  */
void update_led_state(void)
{
    uint32_t current_tick = HAL_GetTick();
    uint32_t interval;

    // 우선순위 1: 대기 상태 (모터 정지) - 빨간색 고정
    if (g_led_priority_state == LED_STATE_STANDBY) {
        set_rgb_led(RGB_RED);
        return;
    }

    // 우선순위 2: 장애물 회피 - 빨간색 깜빡임 (1000ms)
    if (g_led_priority_state == LED_STATE_OBSTACLE) {
        interval = LED_BLINK_INTERVAL_OBSTACLE;

        if (current_tick - g_led_last_update_tick >= interval) {
            g_led_toggle_state = !g_led_toggle_state;
            g_led_last_update_tick = current_tick;

            if (g_led_toggle_state) {
                set_rgb_led(RGB_RED);
            } else {
                set_rgb_led(RGB_OFF);
            }
        }
        return;
    }

    // 우선순위 3: 일반 동작 - 모드와 바닥 타입에 따른 교차 깜빡임 (2:1 비율)
    // g_led_toggle_state: 0 = 베이스 색상(1000ms), 1 = 바닥 색상(500ms)
    if (g_led_toggle_state == 0) {
        interval = LED_BLINK_INTERVAL_BASE;  // 베이스 색상 표시 시간 (1000ms)
    } else {
        interval = LED_BLINK_INTERVAL_FLOOR; // 바닥 색상 표시 시간 (500ms)
    }

    if (current_tick - g_led_last_update_tick >= interval) {
        g_led_toggle_state = !g_led_toggle_state;
        g_led_last_update_tick = current_tick;

        // 베이스 색상 결정 (모드에 따라)
        uint8_t base_r, base_g, base_b;
        if (g_modeManual == 1) {
            // Manual Mode -> Blue
            base_r = 0; base_g = 0; base_b = 1;
        } else {
            // Auto Mode -> White
            base_r = 1; base_g = 1; base_b = 1;
        }

        // 바닥 색상 결정 (Edge-AI 판별 결과에 따라)
        uint8_t floor_r, floor_g, floor_b;
        if (strcmp(g_current_floor, "Hard") == 0) {
            // Hard Floor -> Green
            floor_r = 0; floor_g = 1; floor_b = 0;
        } else if (strcmp(g_current_floor, "Carpet") == 0) {
            // Carpet -> Magenta
            floor_r = 1; floor_g = 0; floor_b = 1;
        } else if (strcmp(g_current_floor, "Dusty") == 0) {
            // Dusty -> Yellow
            floor_r = 1; floor_g = 1; floor_b = 0;
        } else {
            // Unknown -> Off (또는 베이스 색상만 표시)
            floor_r = 0; floor_g = 0; floor_b = 0;
        }

        // 교차 깜빡임: 토글 상태에 따라 베이스 색상 또는 바닥 색상 표시
        // toggle_state = 0 → 베이스 색상 표시 (1000ms)
        // toggle_state = 1 → 바닥 색상 표시 (500ms)
        if (g_led_toggle_state == 0) {
            set_rgb_led(base_r, base_g, base_b);
        } else {
            set_rgb_led(floor_r, floor_g, floor_b);
        }
    }
}

/**
  * @brief 모터 제어를 위해 필요한 초기 설정을 수행합니다.
  * @retval None
  */
void motor_control_init(void)
{
    // 1. PWM 출력 시작 (PA8: ENA, PA9: ENB)
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
    HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);



    // 2. 초기 모터 방향 설정 (정지)
    set_motor_direction(MOTOR_A, STOP);
    set_motor_direction(MOTOR_B, STOP);
    set_motor_direction(MOTOR_C, STOP);

    // 3. 초기 모터 속도 설정 (0)
    set_motor_speed(MOTOR_A, 0);
    set_motor_speed(MOTOR_B, 0);
    set_motor_speed(MOTOR_C, 0);

}

// 현재 control 상태를 PuTTY(USART2)에 출력하는 디버그용 함수
void Send_AT_Command(UART_HandleTypeDef *huart_wiz, UART_HandleTypeDef *huart_term, const char *command, uint8_t *response_buffer, uint16_t buffer_size, uint32_t timeout)
{
    // 1. 터미널(huart_term, PuTTY)로 전송할 명령 표시
    char tx_log[64];
    int len = snprintf(tx_log, sizeof(tx_log), "\r\n[CMD] Sending: %s\r\n", command);
    HAL_UART_Transmit(huart_term, (uint8_t *)tx_log, len, HAL_MAX_DELAY);

    // 2. WizFi360 (huart_wiz)에 명령 전송 (명령어 끝에 CR+LF(\r\n) 필수)
    char cmd_with_crlf[128];
    snprintf(cmd_with_crlf, sizeof(cmd_with_crlf), "%s\r\n", command);
    HAL_UART_Transmit(huart_wiz, (uint8_t *)cmd_with_crlf, strlen(cmd_with_crlf), 500);

