euyju/VibeClean/HW/STM32/Core/Src/main.c
    Debug_PrintControlState(topic, json);
}

// WizFi360이 보낸 한 줄(line)을 토픽 / json 으로 분리
void ParseMqttLine(char *line, int len)
{
    line[len] = '\0';

    // "topic->\"...\"" 형식에서 화살표 위치 찾기
    char *arrow = strstr(line, "->");
    if (!arrow) return;

    *arrow = '\0';
    char *topic = line;
    char *payload = arrow + 2;

    // 공백/따옴표 건너뛰기
    while (*payload == ' ' || *payload == '"' || *payload == '\r' || *payload == '\n')
        payload++;

    // JSON 시작 '{' 위치 찾기
    char *brace = strchr(payload, '{');
    if (!brace) return;

    char *end = strrchr(brace, '}');
    if (!end) return;
    *(end + 1) = '\0';   // JSON 문자열을 '\0'로 끝나게

    HandleControlJson(topic, brace);
}

// WizFi360 응답 버퍼 전체에서 "topic -> { json }" 형태의 구독 메시지를 찾아 처리
void MQTT_ProcessResponseBuffer(uint8_t *buf, uint16_t len)
{
    char line[256];
    uint16_t pos = 0;

    for (uint16_t i = 0; i < len; i++) {
        char c = (char)buf[i];

        // CR은 무시
        if (c == '\r') {
            continue;
        }

        // 줄 끝이거나 line 버퍼가 꽉 찬 경우
        if (c == '\n' || pos >= sizeof(line) - 1) {

            if (pos > 0) {
                line[pos] = '\0';

                // "->" 들어간 라인만 MQTT 메시지로 인정
                if (strstr(line, "->")) {
                    ParseMqttLine(line, strlen(line));
                }
            }

            pos = 0;
        }
        else {
            // 일반 문자는 line에 저장
            line[pos++] = c;
        }
    }

    // 마지막 라인이 '\n' 없이 종료되었을 때 처리
    if (pos > 0) {
        line[pos] = '\0';
        if (strstr(line, "->")) {
            ParseMqttLine(line, strlen(line));
        }
    }
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
//Putty 작동 테스트용 변수
	int countL, countR; //  엔코더 카운트 저장 변수
	char debug_msg[100]; // 디버깅 메시지 버퍼

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM2_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_I2C1_Init();
  MX_USART3_UART_Init();
  MX_TIM3_Init();
  MX_TIM8_Init();
  MX_TIM6_Init();
  /* USER CODE BEGIN 2 */
  // DWT 초기화 (마이크로초 측정을 위해 필수)
  DWT_Init();
  UART_Printf("STM32 HC-SR04 Measurement Ready (Trig: PA0, Echo: PA1)\r\n");


  motor_control_init(); // <- 반드시 호출 (PWM Start + 초기화)
  HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);

  //엔코더 카운팅 시작
  HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_ALL);
  HAL_TIM_Encoder_Start(&htim8, TIM_CHANNEL_ALL);

  // Edge-AI 초기화
  UART_Printf("\r\n=== VibeClean Edge-AI Test ===\r\n");

  // I2C 통신 테스트
  UART_Printf("Testing I2C communication...\r\n");
  uint8_t who_am_i = MPU6050_WhoAmI(&hi2c1);
  UART_Printf("WHO_AM_I Register: 0x%02X (Expected: 0x68)\r\n", who_am_i);

  // MPU6050 센서 초기화
  UART_Printf("Initializing MPU6050...\r\n");
  HAL_StatusTypeDef mpu_status = MPU6050_Init(&hi2c1);

  if (mpu_status == HAL_OK) {
      UART_Printf("MPU6050 Init: OK\r\n");
  } else {
      UART_Printf("MPU6050 Init: FAILED! (Status: %d)\r\n", mpu_status);
      UART_Printf("Check I2C connections (SDA: PB9, SCL: PB8)\r\n");
      UART_Printf("Check MPU6050 power supply (3.3V)\r\n");
      UART_Printf("Check pull-up resistors on SDA/SCL (4.7k ohm)\r\n");
  }

  // Edge Impulse 분류기 초기화
  if (edge_ai_init() == 0) {
      UART_Printf("Edge Impulse Init: OK\r\n");
  } else {
      UART_Printf("Edge Impulse Init: FAILED!\r\n");
  }

  // TIM6 100Hz 인터럽트 시작
  HAL_TIM_Base_Start_IT(&htim6);
  UART_Printf("TIM6 100Hz Timer: Started\r\n");
  UART_Printf("Collecting %d samples (%.1f seconds)...\r\n\r\n",
              EDGE_AI_SAMPLE_COUNT, EDGE_AI_SAMPLE_COUNT / 100.0f);

  // RGB LED 초기화 (초기 상태: OFF)
  set_rgb_led(RGB_OFF);
  UART_Printf("RGB LED: Initialized\r\n");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  int failCount = 0;
  int tempAovoid = 0; // 0 = right, 1 = left

  char post_data_buffer[150]; //json 문자열 버퍼
  uint32_t last_pub_tick = 0; // 마지막 메시지 발행 시간 저장

  char *start_msg = "STM32 WizFi360 MQTT Test Start! (PuTTY=USART2, WizFi360=USART3)\r\n";
  //  HAL_UART_Transmit(&huart2, (uint8_t *)start_msg, strlen(start_msg), HAL_MAX_DELAY);

  HAL_Delay(3000); // WizFi360 부팅 대기

  //  Setup_WiFi_And_MQTT();
  MQTT_Init_All(&huart3, &huart2);   // Wiz: huart1, Terminal: huart2
  
  while (1)
  {
      // === RGB LED 상태 업데이트 (논블로킹 방식) ===
      update_led_state();

      // === IMU 센서 디버깅 출력 (0.1초마다) ===
      if (imu_debug_ready) {
          UART_Printf("[IMU] Ax: %.3fg, Ay: %.3fg, Az: %.3fg\r\n",
                     imu_debug_ax, imu_debug_ay, imu_debug_az);
          imu_debug_ready = 0;  // 플래그 리셋
      }

      // === Edge-AI 테스트 코드 ===
      if (edge_ai_buffer_ready) {
          surface_classification_t result = {0};

          // Edge Impulse 분류기 실행
          if (edge_ai_classify(edge_ai_buffer, EDGE_AI_SAMPLE_COUNT * EDGE_AI_AXES, &result) == 0) {
              // 판별 결과 출력 (Hard, Carpet, Dusty - 대문자 시작)
              UART_Printf("[AI] Hard: %.2f, Carpet: %.2f, Dusty: %.2f\r\n",
                         result.Hard, result.Carpet, result.Dusty);

              // 가장 높은 확률의 노면 타입 저장
              if (result.Hard >= result.Carpet && result.Hard >= result.Dusty) {
                  strcpy(g_current_floor, "Hard");
              } else if (result.Carpet >= result.Hard && result.Carpet >= result.Dusty) {
                  strcpy(g_current_floor, "Carpet");
              } else {
                  strcpy(g_current_floor, "Dusty");
              }
          } else {
              UART_Printf("[AI] Classification FAILED\r\n");
              strcpy(g_current_floor, "Unknown");
          }

          // 버퍼 준비 완료 플래그 리셋
          edge_ai_buffer_ready = 0;
      }

